#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Jan 11 18:54:25 2023

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "C:/Users/w/Desktop/50H_hsstlp_test/ipcore/hsst_test/pnr/example_design/synthesize/hsst_test_dut_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "C:/Users/Li Jie/Desktop/08_hsst_test/08_hsst_test/ipcore/hsst_test/example_design/rtl/hsst_test_src.v"
remove_design -verilog "C:/Users/Li Jie/Desktop/08_hsst_test/08_hsst_test/ipcore/hsst_test/example_design/rtl/hsst_test_chk.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/source/hsst_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/synthesize/hsst_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/pll_1/pll_1.idf
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/adc_fft_hdmi.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/adc_fft_top.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_other/dram_ctrl.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/iic_dri.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/ms72xx_ctl.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/ms7200_ctl.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/ms7210_ctl.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/pattern_vg.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_hdmi/sync_vg.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_fft/data_modulus.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_fft/fft_data_gen.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_fft/fft_demo_00.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_fft/ipsxe_fft_core_v1_1_vpAll.vp"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl_fft/mysqrt.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl/ipml_sdpram_v1_7_drm.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl/ipsxe_fft_distributed_sdpram_v1_2.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rtl/ipsxe_fft_distributed_shiftregister_v1_3.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_18k.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_36k.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/distram_sreg/ipsxe_fft_distram_sreg.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/distram_sdpram/ipsxe_fft_distram_sdpram.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/source/word_align.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/hsst_ad.v"
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/hsst2ad/hsst2ad.idf
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/fifo_16x256/fifo_16x256.idf
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/dram_16x512/dram_16x512.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/adc_fft_hdmi.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/key_filter.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/fifo_eth/fifo_eth.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/hdmi_tx.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/fifo_4096_16i_32o/fifo_4096_16i_32o.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/eth_udp_loop.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/arp.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/eth_ctrl.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/gmii_to_rgmii.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/udp.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/arp_rx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/arp_tx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/crc32_d8.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rgmii_rx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/rgmii_tx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/udp_rx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/udp_tx.v"
add_design "C:/Users/Li Jie/Desktop/hsst_test2/pnr/rtl/pll_sft.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design C:/Users/Li Jie/Desktop/hsst_test2/pnr/example_design/ipcore/eth_rx_buf/eth_rx_buf.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
